podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/AIPS0_MK21FA12.svd.xml
<!--
Devices using this peripheral: 
      MK21FA12
      MK22FA12
-->
      <peripheral>
         <?sourceFile "AIPS0_MK21FA12" ?>
         <name>AIPS0</name>
         <description>AIPS-Lite Bridge</description>
         <groupName>AIPS</groupName>
         <headerStructName>AIPS</headerStructName>
         <baseAddress>0x40000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x3C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MPRA</name>
               <description>Master Privilege Register A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>PACR%s</name>
               <description>Peripheral %sccess Control Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>PACR%s</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Untrusted masters are allowed access</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Untrusted masters are not allowed access</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Supervisor privilege level is not required for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Supervisor privilege level is required for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register derivedFrom="PACR%s"> <name>PACRG</name> <addressOffset>0x48</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRH</name> <addressOffset>0x4C</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRI</name> <addressOffset>0x50</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRJ</name> <addressOffset>0x54</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRK</name> <addressOffset>0x58</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRL</name> <addressOffset>0x5C</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRM</name> <addressOffset>0x60</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRN</name> <addressOffset>0x64</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRO</name> <addressOffset>0x68</addressOffset> </register>
            <register derivedFrom="PACR%s"> <name>PACRP</name> <addressOffset>0x6C</addressOffset> </register>
         </registers>
      </peripheral>
